app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "約束のネバーランド"], ["body", "gdhbgdxf"], ["user_id", 1], ["created_at", "2020-07-04 06:48:57.391744"], ["updated_at", "2020-07-04 06:48:57.391744"]]
SELECT "books".* FROM "books"