app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "merumeru"], ["introduction", "cairns"], ["profile_image_id", "29158c1cef89a939d872bb7624a7224967f6e6e6835176b09f9261e908da"], ["updated_at", "2020-07-04 07:03:11.355767"], ["id", 2]]

  def ensure_correct_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]